MobiOcean.MDM.Web/Content/Client.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:loc="http://www.csapi.org/schema/parlayx/terminal_location/v3_1/local"
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsse:Security soapenv:mustUnderstand="1"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken wsu:Id="UsernameToken-E94B7046761DDFD211151178810277314">
        <wsse:Username>account@mobiocean.com</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">MobiOcean@123</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">p53bO3t4vm2Ybv6DsIqdvA==</wsse:Nonce>
        <wsu:Created>2017-11-27T13:08:22.773Z</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
    <wsa:Action>http://www.csapi.org/schema/parlayx/common/v3_1/TerminalLocation/getLocationForGroupRequest</wsa:Action>
  </soapenv:Header>

  <soapenv:Body>
    <loc:getLocationForGroup>
      <!--1 or more repetitions:-->
      <loc:addresses>9643822820</loc:addresses>
      <loc:addresses>9643700150</loc:addresses>
      <loc:isRealTime>N</loc:isRealTime>
    </loc:getLocationForGroup>
  </soapenv:Body>
</soapenv:Envelope>


<!--<soapenv:Envelope xmlns:loc="http://www.csapi.org/schema/parlayx/terminal_location/v3_1/local" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:Username>account@mobiocean.com</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">MobiOcean@123</wsse:Password>
        --><!--<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">OlERWZpfexO0pPfRDQfnZQ==</wsse:Nonce>
        <wsu:Created>2017-10-17T15:54:17.407Z</wsu:Created>--><!--
      </wsse:UsernameToken>
    </wsse:Security>
    <wsa:Action>http://www.csapi.org/schema/parlayx/common/v3_1/TerminalLocation/getLocationForGroupRequest</wsa:Action>
  </soapenv:Header>
  <soapenv:Body>
    --><!--<loc:getLocation>--><!--
    <loc:getLocationForGroup>
      <loc:address>9643822820</loc:address>
      <loc:realTime>N</loc:realTime>
       </loc:getLocationForGroup>
    --><!--</loc:getLocation>--><!--
  </soapenv:Body>
</soapenv:Envelope>-->